Just happend to me.

After short debugging, it seems to be an issue in the filter logic (filter.go) regarding tables / tables_with_columns. I'm creating a table_with_columns permission here (could also be table, doesnt really matter)

```terraform
resource "aws_lakeformation_permissions" "access" {
  principal = local.principal_arn
  permissions = ["SELECT"]

  table_with_columns {
    catalog_id    = local.catalog_id
    database_name = local.db_name
    name          = local.table_name
    wildcard      = true
  }

}
```

Debug output
```
2022-02-07T16:59:45.068+0100 [INFO]  provider.terraform-provider-aws_v3.74.0_x5: 2022/02/07 16:59:45 [DEBUG] Reading Lake Formation permissions: {
  Principal: {
    DataLakePrincipalIdentifier: "arn:aws:iam::***:role/***"
  },
  Resource: {
    Table: {
      CatalogId: "***",
      DatabaseName: "db_name",
      Name: "table_name"
    }
  }
}
```

Provider tries to do
```
  # aws_lakeformation_permissions.access will be created
  + resource "aws_lakeformation_permissions" "access" {
      + catalog_resource              = false
      + id                            = (known after apply)
      + permissions                   = [
          + "SELECT",
        ]
      + permissions_with_grant_option = (known after apply)
      + principal                     = "arn:aws:iam::***:role/***"

      + data_location {
          + arn        = (known after apply)
          + catalog_id = (known after apply)
        }

      + database {
          + catalog_id = (known after apply)
          + name       = (known after apply)
        }

      + table {
          + catalog_id    = (known after apply)
          + database_name = (known after apply)
          + name          = (known after apply)
          + wildcard      = (known after apply)
        }

      + table_with_columns {
          + catalog_id    = "***"
          + database_name = "db_name"
          + name          = "table_name"
          + wildcard      = true
        }
    }

```

After creating it, the provider tries to check if its there and gets following response
```json
{
  "NextToken": null,
  "PrincipalResourcePermissions": [
    {
      "AdditionalDetails": null,
      "Permissions": [
        "SELECT"
      ],
      "PermissionsWithGrantOption": [],
      "Principal": {
        "DataLakePrincipalIdentifier": "arn:aws:iam::***:role/***"
      },
      "Resource": {
        "Catalog": null,
        "DataCellsFilter": null,
        "DataLocation": null,
        "Database": null,
        "LFTag": null,
        "LFTagPolicy": null,
        "Table": null,
        "TableWithColumns": {
          "CatalogId": "***",
          "ColumnNames": [
            "col1",
            "col2"
          ],
          "ColumnWildcard": null,
          "DatabaseName": "db_name",
          "Name": "table_name"
        }
      }
    }
  ]
}
```

So the provider receives the correct information back, but I think the post filtering is responsible on why the 'NOT FOUND' state is returned 

```go
// clean permissions = filter out permissions that do not pertain to this specific resource
cleanPermissions := FilterPermissions(input, tableType, columnNames, excludedColumnNames, columnWildcard, permissions)

if len(cleanPermissions) == 0 {
	return nil, statusNotFound, nil
}

return permissions, statusAvailable, nil
``` 

This will filter out the returned permission (looking at func FilterTableWithColumnsPermissions) because I did specify the wildcard in terraform, but the returned permission says that ColumnWildcard is set to zero. Instead, it lists all columns in the ColumnNames array. This all seems kind of strange.

I know from your comments that LakeFormation does a lot of implicit stuff (https://github.com/hashicorp/terraform-provider-aws/blob/187f1659a4fef11ac314567273b5470afe6b662f/internal/service/lakeformation/permissions.go#L258), but is there a timeline on when this issue will be addressed? Or is there a hack / workaround for this issue? 

Thanks!